<a href="https://colab.research.google.com/github/sebabratakundu/Approaching_open_ended_DS_problems/blob/master/Approaching_open_ended_DS_problems(Padhai).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Filling Missing Datas

## Using Numpy

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
x = np.array([1,5,2,6])

In [ ]:
x.dtype

dtype('int64')

In [ ]:
x = np.array([1,5,"Na",6])

In [ ]:
x.dtype

dtype('<U21')

In [ ]:
x.sum()

TypeError: ignored

In [ ]:
x = np.array([1,5,"--",6])

In [ ]:
x.sum()

TypeError: ignored

In [ ]:
# but standard approch

x = np.array([1,5,None,6])

In [ ]:
x.sum()

TypeError: ignored

In [ ]:
#another standard way

x = np.array([1,5,np.nan,6])

In [ ]:
x.sum()

nan

Filling the missing Value

In [ ]:
x_b = [True,True,False,True]

In [ ]:
x[x_b]

array([1., 5., 6.])

In [ ]:
x[x_b].sum(),x[x_b].mean()

(12.0, 4.0)

In [ ]:
## numpy predefined function for filling missing value

m_x = np.ma.masked_array(x,mask=[0,0,1,0]);  # here we mask the missing value by applying values in mask, i.e we are try to remove the value which has mask 1.

In [ ]:
m_x.mean()

4.0

In [ ]:
m_x.sum()

12.0

## Using Pandas

In [ ]:
df = pd.read_csv("rooms.csv");

In [ ]:
df.head()

   Room_Number Num_Students  Department Occupied
0        101.0            1  Mechanical        Y
1        102.0          NaN       Empty        N
2        103.0            3  Electrical        Y
3        104.0            2  Mechanical        Y
4        105.0          NaN    Chemical        N

In [ ]:
df.dtypes

Room_Number     float64
Num_Students     object
Department       object
Occupied         object
dtype: object

object dtype is not very efficient as the int of float dtype

In [ ]:
%%timeit

np.arange(100000,dtype="int").sum()

1000 loops, best of 3: 259 Âµs per loop

In [ ]:
%%timeit

np.arange(100000,dtype="object").sum()

100 loops, best of 3: 6.04 ms per loop

In [ ]:
df.columns

Index(['Room_Number', 'Num_Students', 'Department', 'Occupied'], dtype='object')

In [ ]:
df.Room_Number.isnull()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
9    False
Name: Room_Number, dtype: bool

In [ ]:
df.Room_Number.isnull().sum()

1

In [ ]:
df.isnull()

   Room_Number  Num_Students  Department  Occupied
0        False         False       False     False
1        False          True       False     False
2        False         False       False     False
3        False         False       False     False
4        False          True       False     False
5         True         False       False     False
6        False         False       False     False
7        False          True       False     False
8        False         False       False      True
9        False         False       False     False

In [ ]:
df.isnull().sum()

Room_Number     1
Num_Students    3
Department      0
Occupied        1
dtype: int64

In [ ]:
missing_values = ["n/a","na","NA",""]

In [ ]:
#we are defining the missing values and then read the data as dataframe so that pandas can treate that values as missing values

df = pd.read_csv("rooms.csv",na_values=missing_values);

In [ ]:
df.isnull()

   Room_Number  Num_Students  Department  Occupied
0        False         False       False     False
1        False          True       False     False
2        False         False       False     False
3        False         False       False     False
4        False          True       False     False
5         True         False       False     False
6        False         False       False     False
7        False          True       False     False
8        False          True       False      True
9        False         False       False     False

In [ ]:
df.Num_Students.sum()

12.0

In [ ]:
df.Num_Students.mean()

2.0

In [ ]:
missing_values = ["n/a","na","NA","","--","Empty"]

In [ ]:
#we are defining the missing values and then read the data as dataframe so that pandas can treate that values as missing values

df = pd.read_csv("rooms.csv",na_values=missing_values);

In [ ]:
df.isnull()

   Room_Number  Num_Students  Department  Occupied
0        False         False       False     False
1        False          True        True     False
2        False         False       False     False
3        False         False       False     False
4        False          True       False     False
5         True         False       False     False
6        False         False       False      True
7        False          True       False     False
8        False          True       False      True
9        False         False       False     False

Filling the missing values

for Occupied

In [ ]:
df.Occupied.fillna("N",inplace=True)

In [ ]:
df

   Room_Number  Num_Students  Department Occupied
0        101.0           1.0  Mechanical        Y
1        102.0           NaN         NaN        N
2        103.0           3.0  Electrical        Y
3        104.0           2.0  Mechanical        Y
4        105.0           NaN    Chemical        N
5          NaN           1.0  Electrical        Y
6        107.0           3.0       Civil        N
7        108.0           NaN          CS        Y
8        109.0           NaN  Mechanical        N
9        110.0           2.0          CS        N

In [ ]:
df.Occupied = df.Occupied.map(lambda x : True if x=="Y" else False)

In [ ]:
df

   Room_Number  Num_Students  Department  Occupied
0        101.0           1.0  Mechanical      True
1        102.0           NaN         NaN     False
2        103.0           3.0  Electrical      True
3        104.0           2.0  Mechanical      True
4        105.0           NaN    Chemical     False
5          NaN           1.0  Electrical      True
6        107.0           3.0       Civil     False
7        108.0           NaN          CS      True
8        109.0           NaN  Mechanical     False
9        110.0           2.0          CS     False

for Department

In [ ]:
df["Dept2"] = df.Department

In [ ]:
df.Department.fillna(method="ffill",inplace=True)

# it also called pad
df.Department.fillna(method="pad",inplace=True)

In [ ]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           NaN  Mechanical     False         NaN
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           NaN    Chemical     False    Chemical
5          NaN           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           NaN          CS      True          CS
8        109.0           NaN  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS

In [ ]:
df.Dept2.fillna(method="bfill",inplace=True)

In [ ]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           NaN  Mechanical     False  Electrical
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           NaN    Chemical     False    Chemical
5          NaN           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           NaN          CS      True          CS
8        109.0           NaN  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS

For no of Students

In [ ]:
df.Num_Students.sum()

12.0

In [ ]:
df.Num_Students.fillna(df.Num_Students.median(),inplace=True)

In [ ]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           2.0  Mechanical     False  Electrical
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           2.0    Chemical     False    Chemical
5          NaN           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           2.0          CS      True          CS
8        109.0           2.0  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS

For Room Numbers

In [ ]:
df.Room_Number.interpolate(inplace=True)

In [ ]:
df

   Room_Number  Num_Students  Department  Occupied       Dept2
0        101.0           1.0  Mechanical      True  Mechanical
1        102.0           2.0  Mechanical     False  Electrical
2        103.0           3.0  Electrical      True  Electrical
3        104.0           2.0  Mechanical      True  Mechanical
4        105.0           2.0    Chemical     False    Chemical
5        106.0           1.0  Electrical      True  Electrical
6        107.0           3.0       Civil     False       Civil
7        108.0           2.0          CS      True          CS
8        109.0           2.0  Mechanical     False  Mechanical
9        110.0           2.0          CS     False          CS

# Open ended Descriptive statistics

In [ ]:
df = pd.read_csv("apy.csv")

In [ ]:
df.head()

                    State_Name District_Name  ...    Area Production
0  Andaman and Nicobar Islands      NICOBARS  ...  1254.0       2000
1  Andaman and Nicobar Islands      NICOBARS  ...     2.0          1
2  Andaman and Nicobar Islands      NICOBARS  ...   102.0        321
3  Andaman and Nicobar Islands      NICOBARS  ...   176.0        641
4  Andaman and Nicobar Islands      NICOBARS  ...   720.0        165

[5 rows x 7 columns]